In [1]:
import numpy as np
import pandas as pd

In [5]:
l1=[2,5,8,6,8,9,4,6]
l1[0]

2

In [8]:
d1={'a':2, 'b':5}

for i, j in enumerate(l1):
    print(i, j)
print('\n')
for i, j in enumerate(d1):
    print (i, j)

0 2
1 5
2 8
3 6
4 8
5 9
6 4
7 6


0 a
1 b

In [9]:
pd.Series(l1)

0    2
1    5
2    8
3    6
4    8
5    9
6    4
7    6
dtype: int64

In [ ]:
dt = {'a':3, 'b':4, 'c':5}
t1 = (3,4,5)
#Series using tuple
s1=pd.Series(t1, index=['a','b','c'])
s1

a    3
b    4
c    5
dtype: int64

In [27]:
#using list
lt=[4, 'hi', 'hello', 8, 45]
s3= pd.Series(lt, index=['h', 'i', 'j', 'k', 'l'])
s3

h        4
i       hi
j    hello
k        8
l       45
dtype: object

In [14]:
t1 = pd.Series([3,4,5], index=['a', 'b', 'c'])
t2 = pd.Series([3,5,8], index= ['a', 'b', 'c'])
t1+t2

a     6
b     9
c    13
dtype: int64

In [15]:
s1 = pd.Series([3,4,5], index=['a', 'b', 'c'])
s2 = pd.Series([3,5,8], index= ['a', 'b', 'd'])
s1+s2

a    6.0
b    9.0
c    NaN
d    NaN
dtype: float64

In [16]:
s1

a    3
b    4
c    5
dtype: int64

In [25]:
print(s1['a'])
print(s1['b'])

3
4

In [28]:
s3

h        4
i       hi
j    hello
k        8
l       45
dtype: object

In [ ]:
s3[0:3] #last range is excluded in position based indexing

h        4
i       hi
j    hello
dtype: object

In [ ]:
s3['h':'k'] #last range is included in label based indexing

h        4
i       hi
j    hello
k        8
dtype: object

In [31]:
s3[['h', 'j', 'l']] #random label indexing will required []

h        4
j    hello
l       45
dtype: object

In [32]:
#new series:
veg = pd.Series({'potato': 3, 'tomato':6, 'chilly':2, 'pumpkin':8, "carrot":10, "radish":12})
veg

potato      3
tomato      6
chilly      2
pumpkin     8
carrot     10
radish     12
dtype: int64

In [33]:
veg.values

array([ 3,  6,  2,  8, 10, 12])

In [34]:
veg.index

Index(['potato', 'tomato', 'chilly', 'pumpkin', 'carrot', 'radish'], dtype='object')

In [35]:
veg.shape

(6,)

In [36]:
veg.values

array([ 3,  6,  2,  8, 10, 12])

In [37]:
veg

potato      3
tomato      6
chilly      2
pumpkin     8
carrot     10
radish     12
dtype: int64

In [39]:
veg.iloc[0]

np.int64(3)

In [40]:
veg['carrot'] #using label

np.int64(10)

In [41]:
veg['pumpkin':'radish'] #range of records last reange is included for label

pumpkin     8
carrot     10
radish     12
dtype: int64

In [ ]:
veg.iloc[1:4] #last range is exluded it will go till 3 index only

tomato     6
chilly     2
pumpkin    8
dtype: int64

In [43]:
veg[['tomato', 'radish', 'pumpkin']]

tomato      6
radish     12
pumpkin     8
dtype: int64

In [44]:
veg['tomato':]

tomato      6
chilly      2
pumpkin     8
carrot     10
radish     12
dtype: int64

In [45]:
veg[:'pumpkin']

potato     3
tomato     6
chilly     2
pumpkin    8
dtype: int64

In [46]:
veg[1:4]

tomato     6
chilly     2
pumpkin    8
dtype: int64

In [48]:
print(veg)
veg[1::2]

potato      3
tomato      6
chilly      2
pumpkin     8
carrot     10
radish     12
dtype: int64

tomato      6
pumpkin     8
radish     12
dtype: int64

In [49]:
veg[1::3]

tomato     6
carrot    10
dtype: int64

In [ ]:
#iloc/loc
#loc : label based indexing
#iloc : position based indexing
print(veg.loc['tomato':'carrot'])
print(veg['tomato':'carrot'])

tomato      6
chilly      2
pumpkin     8
carrot     10
dtype: int64

In [53]:
print(veg.iloc[0:4])
print('\n')
print(veg[0:4])

potato     3
tomato     6
chilly     2
pumpkin    8
dtype: int64


potato     3
tomato     6
chilly     2
pumpkin    8
dtype: int64

In [ ]:
veg>2 #boolean output

potato      True
tomato      True
chilly     False
pumpkin     True
carrot      True
radish      True
dtype: bool

In [56]:
veg[veg>3]

tomato      6
pumpkin     8
carrot     10
radish     12
dtype: int64

In [57]:
veg.head() # for top 5 elements

potato      3
tomato      6
chilly      2
pumpkin     8
carrot     10
dtype: int64

In [ ]:
veg.head(2) # 2 from top. if we don't give any value then it gives you top 5. you can also give 100 to get top 100 records.

potato    3
tomato    6
dtype: int64

In [59]:
veg.tail() # 5 from bottom

tomato      6
chilly      2
pumpkin     8
carrot     10
radish     12
dtype: int64

In [60]:
veg.tail(2)

carrot    10
radish    12
dtype: int64

In [61]:
veg[2:5]

chilly      2
pumpkin     8
carrot     10
dtype: int64

In [62]:
veg[:3]

potato    3
tomato    6
chilly    2
dtype: int64

In [64]:
veg[4:]

carrot    10
radish    12
dtype: int64

In [70]:
#check any value belogns to the series
veg.isin([22])

potato     False
tomato     False
chilly     False
pumpkin    False
carrot     False
radish     False
dtype: bool

In [69]:
veg.isin([12])

potato     False
tomato     False
chilly     False
pumpkin    False
carrot     False
radish      True
dtype: bool

In [71]:
veg[veg.isin([12])]

radish    12
dtype: int64

In [73]:
#find unique values and their frequencies
new = pd.Series(list('abcd'*4))
new

0     a
1     b
2     c
3     d
4     a
5     b
6     c
7     d
8     a
9     b
10    c
11    d
12    a
13    b
14    c
15    d
dtype: object

In [74]:
#unique(): name of all unique records
#nunique(): caount of unique records
#value_counts(): name of unique records with their occurences
new.unique()

array(['a', 'b', 'c', 'd'], dtype=object)

In [75]:
new.nunique()

4

In [76]:
new.value_counts()

a    4
b    4
c    4
d    4
Name: count, dtype: int64

In [77]:
#dealing with duplicates
new.duplicated()

0     False
1     False
2     False
3     False
4      True
5      True
6      True
7      True
8      True
9      True
10     True
11     True
12     True
13     True
14     True
15     True
dtype: bool

In [78]:
new[new.duplicated()]

4     a
5     b
6     c
7     d
8     a
9     b
10    c
11    d
12    a
13    b
14    c
15    d
dtype: object

In [ ]:
new.drop_duplicates() #it will not change the original series here it is "new"

0    a
1    b
2    c
3    d
dtype: object

In [ ]:
new

0     a
1     b
2     c
3     d
4     a
5     b
6     c
7     d
8     a
9     b
10    c
11    d
12    a
13    b
14    c
15    d
dtype: object

In [84]:
#sorting the data
#sort_values, sort_index
veg.sort_values()

chilly      2
potato      3
tomato      6
pumpkin     8
carrot     10
radish     12
dtype: int64

In [83]:
veg.sort_index()

carrot     10
chilly      2
potato      3
pumpkin     8
radish     12
tomato      6
dtype: int64

In [88]:
print(new.sort_values())

0     a
4     a
8     a
12    a
1     b
5     b
9     b
13    b
2     c
6     c
10    c
14    c
3     d
7     d
11    d
15    d
dtype: object

In [87]:
print(new.sort_index())

0     a
1     b
2     c
3     d
4     a
5     b
6     c
7     d
8     a
9     b
10    c
11    d
12    a
13    b
14    c
15    d
dtype: object

In [89]:
#dealing with missing data
x=pd.Series([2,4,5,3, np.nan, 3, np.nan])
x

0    2.0
1    4.0
2    5.0
3    3.0
4    NaN
5    3.0
6    NaN
dtype: float64

In [90]:
x.isnull()

0    False
1    False
2    False
3    False
4     True
5    False
6     True
dtype: bool

In [91]:
x.isnull().sum()

np.int64(2)

In [92]:
x.notnull()

0     True
1     True
2     True
3     True
4    False
5     True
6    False
dtype: bool

In [93]:
x.fillna(200)

0      2.0
1      4.0
2      5.0
3      3.0
4    200.0
5      3.0
6    200.0
dtype: float64

In [94]:
x.fillna(x.mean())

0    2.0
1    4.0
2    5.0
3    3.0
4    3.4
5    3.0
6    3.4
dtype: float64

In [95]:
x.mean()

np.float64(3.4)

In [96]:
#ffill() bfill()
x

0    2.0
1    4.0
2    5.0
3    3.0
4    NaN
5    3.0
6    NaN
dtype: float64

In [97]:
x.ffill()

0    2.0
1    4.0
2    5.0
3    3.0
4    3.0
5    3.0
6    3.0
dtype: float64

In [98]:
x.bfill()

0    2.0
1    4.0
2    5.0
3    3.0
4    3.0
5    3.0
6    NaN
dtype: float64

In [99]:
x.dropna()

0    2.0
1    4.0
2    5.0
3    3.0
5    3.0
dtype: float64

In [100]:
check = pd.Series(['alex', 'mathew', 'john', 'romain'])
check

0      alex
1    mathew
2      john
3    romain
dtype: object

In [101]:
check.map(lambda x:len(x))

0    4
1    6
2    4
3    6
dtype: int64

In [102]:
#series : one dim
#Dataframe: 2 dimentional, tabular/sql table/csv or excel etc
dt = pd.DataFrame()
dt

Empty DataFrame
Columns: []
Index: []

In [103]:
dt1 = [5,3,7,6,5,4]
dt2=pd.DataFrame(dt1)
dt2

   0
0  5
1  3
2  7
3  6
4  5
5  4

In [105]:
data = [['alex',30],['mathew',45],['romain',56]]
dt3=pd.DataFrame(data,columns=['name', 'age'])
dt3

     name  age
0    alex   30
1  mathew   45
2  romain   56

In [115]:
data={'name':['tom','alan','jack','rosy','jell', 'lily', 'mak'],'age':[34,76,35,67,33,57,32]}
dt4=pd.DataFrame(data,index=['rank1', 'rank2', 'rank3', 'rank4', 'rank5', 'rank6', 'rank7'])
dt4

       name  age
rank1   tom   34
rank2  alan   76
rank3  jack   35
rank4  rosy   67
rank5  jell   33
rank6  lily   57
rank7   mak   32

In [112]:
dt4.shape

(4, 2)

In [113]:
dt4.dtypes

name    object
age      int64
dtype: object

In [116]:
print(dt4.head())
print(dt4.tail())

       name  age
rank1   tom   34
rank2  alan   76
rank3  jack   35
rank4  rosy   67
rank5  jell   33
       name  age
rank3  jack   35
rank4  rosy   67
rank5  jell   33
rank6  lily   57
rank7   mak   32

In [117]:
dt4.tail(2)

       name  age
rank6  lily   57
rank7   mak   32

In [ ]:
dt4[2:4] #last range will be excluded

       name  age
rank3  jack   35
rank4  rosy   67

In [119]:
dt4['name']

rank1     tom
rank2    alan
rank3    jack
rank4    rosy
rank5    jell
rank6    lily
rank7     mak
Name: name, dtype: object

In [120]:
dt4.name

rank1     tom
rank2    alan
rank3    jack
rank4    rosy
rank5    jell
rank6    lily
rank7     mak
Name: name, dtype: object

In [122]:
df = pd.DataFrame(np.random.randint(0,50,20).reshape(5,4),index=list('abcde'),columns=list('pqrs'))
df

    p   q   r   s
a  37   1  34  17
b  12   2  28  33
c  15  29   3   3
d  45  10   7   9
e  19  20  44   4

In [123]:
list('abcde')

['a', 'b', 'c', 'd', 'e']

In [124]:
df['p':'r']

Empty DataFrame
Columns: [p, q, r, s]
Index: []

In [125]:
#loc : Label based indexing
#iloc: position based index
df.loc['a':'d', 'p':'r']  #df.loc[row, col]

    p   q   r
a  37   1  34
b  12   2  28
c  15  29   3
d  45  10   7

In [126]:
df.iloc[1:3, 0:2]

    p   q
b  12   2
c  15  29

In [127]:
df.iloc[0:4,0:3]

    p   q   r
a  37   1  34
b  12   2  28
c  15  29   3
d  45  10   7